Tekla Open API Reference for Tekla Structures 2025
ReinforcementSelectionForm.SelectedGrade Property
 Gets the selected rebar grade.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string SelectedGrade { get; set; }
Public Property SelectedGrade As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ReinforcementSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace